package com.web.config;

import com.service.base.apilist.enums.JsonReturnCodeEnum;

/**
 * Created by yoara on 2017/9/5.
 */
public enum MgrReturnCodeEnum implements JsonReturnCodeEnum {
    /**登录模块**/
    F0101("手机号或密码有误"),
    F0102("登录次数超过限制，请2分钟后再试"),
    F0103("当前岗位暂未开放此权限"),
    F0104("请输入正确的图形验证码"),
    F0105("短信验证码发送失败，请稍后再试"),
    F0106("请输入正确的短信验证码"),
    F0107("短信验证码每隔60秒获取一次"),
    F0108("用户信息不存在"),
    F0109("用户状态无效，无法登陆"),
    F0110("系统维护中，仅维护人员可以登录，请稍后再试"),
    F0111("您今日获取验证码的次数过多，请明天再试"),
    F0112("该手机号已被注册"),
    F0113("该账户不是管理员，无法修改"),
    F0114("该手机号未被注册/未被添加，请先注册或请求贵司管理员添加后，再登录"),
    F0115("新密码与原密码相同,无需修改"),
    F0116("注册失败，请重试或联系相关客服"),
    F0117("手机号不能为空"),
    F0118("该手机号未被注册，可进一步完善个人信息"),
    /**店铺管理**/
    F0601("岗位名称已存在"),
    F0602("自定义岗位不能超过10个"),
    /**通用模块**/
    F0401("文件上传失败"),
    F0201("处理失败"),

    /** 合同管理模块 **/
    F0301("合同添加失败,该房源不存在!"),
    F0302("合同查询失败"),
    F0303("合同编辑失败"),
    F0304("合同特改失败"),
    F0305("续签失败,请检查续约时间以及房源是否有生效合同!"),
	F0306("E签宝调用失败"),
    F0307("合同开始时间输入异常"),
    F0308("合同开始时间输入异常,请选择当前时间之前的日期"),
    F0309("签约时间输入异常,请选择当前时间和合同开始时间之间的日期"),
    F0310("签约时间输入异常,请选择当前时间之前的日期"),
    F0311("换租时房源不能是原房源"),
    F0312("转租时租客不能是原租客"),
    F0313("合同开始时间输入异常,请选择上一份合同结束时间之后"),
    F0314("旧合同为预到期/到期未退时才可续签"),
    F0315("旧合同为待入住/租期中/预到期时才可换租"),
    F0316("旧合同为待入住/租期中/预到期时才可转租"),
    F0317("不允许对纸质合同进行电子合同转租,换租,续租"),
    F0318("抱歉，您的电子签约功能未开通，请联系贵司超级管理员在电子签约模块中开启该功能"),
    F0319("抱歉，您当前未进行企业实名认证，不可使用电子签约功能，请联系贵司超级管理员在电子签约模块中在线申请企业认证"),
    F0320("抱歉，您当前未启用电子印章，不能正常使用电子签约功能"),
    F0321("抱歉，当前暂无可以使用的合同模板，不能正常进行电子签约"),
    F0322("当前合同正在签约,无法作废"),
    F0323("补录合同不能签署电子合同"),
    F0324("抱歉，您当前未签署授权委托书，不能正常进行电子签约"),
    F0325("该房源已承租"),
    F0326("合同添加失败"),
    F0327("换租合同开始日期只能选择当前日期前后"),
    F0328("换租合同开始日期不能在旧合同开始时间之前"),
    F0329("换租合同开始日期不能超过旧合同结束时间"),
    F0330("转租合同开始日期只能选择旧合同周期之内的任意日期"),
    F0331("换租合同结束日期只能选择旧合同结束日期之后的任意日期"),
    F0332("合同开始时间不能大于合同结束时间"),
    F0333("当前房源不存在,请联系贵公司管理员"),
    F0334("合同开始时间或结束时间不能超出房源收房结束时间 "),
    F0335("合同开始时间或结束时间不能在房源收房开始时间之前 "),
    F0336("前后端房源租金不一致"),

    /**房源管理模块**/
    S0201("当前房源已存在于系统中"),
    S0202("房源审核不通过内容字数在5至100之间"),
    S0203("楼盘字典无此楼盘用途"),
    S0204("楼盘字典无此楼栋信息"),
    S0205("楼盘字典无此房间号信息"),
    S0206("楼盘字典无此房间信息"),
    S0207("该楼盘无房间信息"),

    /** 首页推荐房源模块**/
    S0301("暂无上架房情"),
    S0302("推荐房源数量最大为5套"),

    /** 合同管理模块**/
    S0401("合同审核内容字数在5至200之间"),


    /**人员组织**/
    F0501("用户旧密码不正确"),

    /**廣告模块**/
    S0701("处理失败，不能重复添加！"),
    S0601("添加成功，但最大上架数不得超5条，請先下架部分广告再手动上架！"),
    S0602("已有5条上架广告！请先下架一部分广告，再进行上架！"),
    S0603("不存在的广告！"),

    /**长租订单**/
    F2500("退租单不存在"),
    F2501("退租单已支付"),
    F2502("调用退租单支付接口异常"),
    F2503("退租单无需支付"),
    F2504("该租客有未支付账单~"),
    F2505("您上期账单还未付款，请先付款上期账单"),
    /**电子合同相关**/
    F2600("电子合同初始化失败"),
    F2601("电子签用户注册失败"),
    F2602("电子签用户签署失败"),
    F2603("电子签合同文件读取失败"),

    /** 城市配置 **/
    F2700("Id或城市分公司ID不得都为空"),

    /**账单支付**/
    F2800("账单已支付"),
    F2801("该账单不在待收状态"),
    F2802("该账单未支付成功"),
    F2803("账单参数有误"),

    /** 微信个人中心登入 **/
    F3001("获取用户微信信息失败"),
    F3002("用户登录授权信息已过期"),
    F3003("手机号已被别人注册哟"),
    F3004("一天最多只能修改一次绑定手机"),

    /**渠道微信登录**/
    F1005("获取用户微信信息失败"),
    F1006("用户登录授权信息已过期"),
    F1008("需绑定手机号"),
    /**运营商管理**/
    F4001("运营商未开通渠道端推广"),
    F4002("运营商未开启渠道端推广"),
    F4003("合同签约中"),

    /**推广房源*/
    F601("该房源已出租,被删除,正在推广审核或发布中,请刷新页面后重试"),
    F602("存在已出租或被删除的房源,请刷新页面后重试"),
    F603("该房源未上传图片,请编辑后重试"),
    F604("存在未上传图片的房源,请编辑后重试"),
    ;
    private String msg;

    MgrReturnCodeEnum(String msg){
        this.msg = msg;
    }

    @Override
    public String getMessage() {
        return msg;
    }

    @Override
    public String getStatus() {
        return name();
    }
}
